OpenFOAM-6-AP/tutorials/multiphase/reactingTwoPhaseEulerFoam/RAS/wallBoiling/0/T.gas
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "5";
    object      T.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 368;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 368;
    }
    outlet
    {
        type            inletOutlet;
        phi             phi.gas;
        inletValue      uniform 368;
        value           uniform 368;
    }
    wall1
    {
        type            zeroGradient;
    }
    wall2
    {
        type            copiedFixedValue;
        sourceFieldName T.liquid;
        value           uniform 368;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
